# -*- coding: utf-8  -*-
################################################
# hint
# 本题的有两种思路：（1）两层循环进行枚举 （2）用树状数组解
# 两层循环进行枚举法：这个简单来说就是外层for循环遍历每一条
# 鱼，内层循环循环模拟每一条鱼向左看
################################################
n = int(input())  # 鱼的数目
a = list(map(int, input().split(' ')))  # 定义一个数组用以记录每条鱼的可爱程度
cute = []  # 定义一个数组用来记录每条鱼眼中有多少只鱼不如自己

for f in range(0, len(a)):  # 遍历每一条鱼
    count = 0
    for i in range(0, f):  # 模拟每一条鱼向左看
        if a[f] > a[i]:
            count += 1
    cute.append(count)  # 记录第f条鱼眼中有多少只鱼不如自己可爱

print(*cute, sep=' ')
