################################################
# hint
# 本题是斐波那契数列问题
# 解法1：循环迭代
################################################
n = int(input())  # 输入一个自然数n
f = [0] * 50
f[0] = 0
f[1] = 1
f[2] = 1
for i in range(3, n + 1):
    f[i] = f[i - 1] + f[i - 2]
print("%.2f" % f[n])

################################################
# 本题是斐波那契数列问题
# 解法2：递归（python3会超时）
################################################

def fib(n):
    if n == 1 or n == 2:  # 递归边界
        return 1
    elif n == 0:
        return 0
    else:
        return fib(n - 1) + fib(n - 2)  # 递归式


n = int(input())
print("%.2f" % fib(n))
